emacs-config.org
#+TITLE: Emacs Configuration
#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t; -*-
#+END_SRC

* Utils
#+BEGIN_SRC emacs-lisp
(cl-evenp 1)

(defmacro defcmd (&rest body)
  `(lambda ()
     (interactive)
     ,@body))
(cl-tagbody
 0 (progn (message "0") (go 2))
 1 (progn (message "1") (go 3))
 2 (progn (message "2") (go 1))
 3 (progn (message "3") )
 )

(block bar
  (block foo
    (print 'hello)     ; evaluated
    (return-from bar 42)
    (print 'goodbye)))  ; not evaluated
     #+END_SRC
* Global Customization
** User
#+NAME: 41.4 User Identification
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Adarsh Melethil"
      user-mail-address "adarshmelethil@gmail.com")
#+END_SRC
** System
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t
      inhibit-startup-echo-area-message "adarshmelethil"
      initial-scratch-message "Adarsh's Emacs"
      ;; Line numbers
      display-line-numbers-major-tick 0
      global-display-line-numbers-mode 'visual
      display-line-numbers-type 'visual
      display-line-numbers 'visual
      column-number-mode t
      ;; Parens
      show-paren-style 'mixed
      ;; doom-font (font-spec :family "Red Hat Mono" :size 12)
      )
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+END_SRC
** Directories
#+BEGIN_SRC emacs-lisp
(setq
 work-dir (concat (file-name-as-directory (getenv "HOME")) "work")
 org-dir (concat (file-name-as-directory work-dir) "org")
 src-dir (concat (file-name-as-directory work-dir) "src")
 scripts-dir (concat (file-name-as-directory work-dir) "scripts")
 bin-dir (concat (file-name-as-directory work-dir) "bin")
 conda-root-dir (concat (file-name-as-directory (getenv "HOME")) "miniforge3"))
#+END_SRC


* Packages
** straight.el
#+NAME: Configuration
#+BEGIN_SRC emacs-lisp
(defconst bootstrap-version 5)
(setq straight-repository-branch "develop"
      straight-use-package-by-default t
      straight-base-dir personal-emacs-config-dir)
#+END_SRC

#+NAME: Bootstrap
#+BEGIN_SRC emacs-lisp
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" straight-base-dir)))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC
** use-package
#+BEGIN_SRC emacs-lisp
(straight-use-package 'use-package)
#+END_SRC
** Themes
#+BEGIN_SRC emacs-lisp
(use-package cyberpunk
  :no-require t
  :ensure t
  :straight '(cyberpunk
              :type git
              :host github
              :repo "n3mo/cyberpunk-theme.el")
  :init (load-theme 'cyberpunk t))
#+END_SRC
** Libraries
*** string
#+BEGIN_SRC emacs-lisp
(use-package s)
#+END_SRC
*** hashtable
#+BEGIN_SRC emacs-lisp
(use-package ht)
#+END_SRC
*** Files
#+BEGIN_SRC emacs-lisp
(use-package f)
#+END_SRC
*** Concurrent
#+BEGIN_SRC emacs-lisp
(use-package signal)
(use-package deferred)
#+END_SRC
*** Parse
#+BEGIN_SRC emacs-lisp
(use-package tree-sitter
  :config
  (global-tree-sitter-mode))
(use-package tree-sitter-langs)
(use-package moldable-emacs
  :straight '(moldable-emacs
              :type git
              :host github
              :repo "ag91/moldable-emacs"))
#+END_SRC
*** functional
#+BEGIN_SRC emacs-lisp
(use-package dash)
#+END_SRC
**** Anaphora
aand ablock acase acond aecase aetypecase aif alambda alet aprog1 aprog2 atypecase awhen awhile a+ a- a* a/
#+BEGIN_SRC emacs-lisp
(use-package anaphora)
#+END_SRC
*** GUI
#+BEGIN_SRC emacs-lisp
(use-package svg-lib)
#+END_SRC
** Helpers
#+BEGIN_SRC emacs-lisp
(use-package discover
  :ensure t
  :init (global-discover-mode 1))
#+END_SRC
** Keys
*** which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :init
  (which-key-mode 1)
  :config
  (which-key-setup-side-window-right-bottom))
#+END_SRC
*** evil
#+BEGIN_SRC emacs-lisp
(use-package evil
  :config (evil-mode 1))
#+END_SRC
*** general
#+BEGIN_SRC emacs-lisp
(use-package general
  :after (dash)
  :config
  (general-create-definer spc-leader-def :prefix "SPC")
  (general-def 'normal
    "<up>" #'evil-window-up
    "<down>" #'evil-window-down
    "<right>" #'evil-window-right
    "<left>" #'evil-window-left)
  (spc-leader-def 'normal
                  "<up>" #'split-window-vertically
                  "<down>" (cmd (split-window-vertically) (evil-window-down 1))
                  "<right>" (cmd (split-window-horizontally) (evil-window-right 1))
                  "<left>" #'split-window-horizontally))
#+END_SRC
** Projects
*** undo-tree
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :config (global-undo-tree-mode))
#+END_SRC
*** goto-chg.el
#+BEGIN_SRC emacs-lisp
(use-package goto-chg)
#+END_SRC
*** ivy+counsel+swiper
#+BEGIN_SRC emacs-lisp
(use-package ivy :config (ivy-mode))
(use-package counsel :after ivy :config (counsel-mode))
(use-package swiper :after ivy
  :commands swiper
  :config
  (setq ivy-use-selectable-prompt t
        search-default-mode #'char-fold-to-regexp)
  :general
  (spc-leader-def 'normal "b f" #'swiper))
#+END_SRC
*** git
#+BEGIN_SRC emacs-lisp
(use-package magit :ensure t)
#+END_SRC
*** projectile
#+BEGIN_SRC emacs-lisp
(use-package projectile :ensure t
  :init (projectile-mode +1)
  :bind-keymap ("C-x p" . projectile-command-map)
  ;; (:prefix-command projectile-mode-map "SPC p")
  )
#+END_SRC
*** perspective
#+BEGIN_SRC emacs-lisp
(use-package perspective)
(use-package persp-projectile
  :after (perspective projectile))
#+END_SRC

** GUI Extention
#+BEGIN_SRC emacs-lisp
(require 'f)
;; (use-package svg-tag-tags
;;  :after svg-lib
;;  :straight '(svg-tag-tags
;;              :type git
;;              :host github
;;              :repo "rougier/svg-tag-mode")
;; :custom
;; (svg-tag-tags
;;  '((":TODO:" . ((lambda (tag) (svg-tag-make "TODO"))))))
;;  )
#+END_SRC

* Custom
#+BEGIN_SRC emacs-lisp
(require 'deferred)

(deferred:$
  (deferred:process "which" "python")
  (deferred:nextc it
    (lambda (x) (message "%s" x))))
#+END_SRC
